"""
N = 1, ans = 1
: 1
N = 2, ans = 2 
: 1 1, 00
N = 3, ans = 3
: 1 11, 1 00, 00 1
=>: 1 00, 00 1, 1 1 1
'00'(혹은 '1')에서 앞에 하나가 쓰이거나 두 개가 쓰이거나 하는 경우를 구해주면 된다.
N = 4,
1 1 00, 00 00, 
1 00 1, 00 1 1, 1 1 1 1
"""
import sys 
input = sys.stdin.readline

N = int(input())
dp = [[0 for _ in range(2)] for _ in range(N + 1)]

dp[1] = [0, 1] # 0인덱스에 위치한 값은 '00', 1인덱스에 위치한 값은 '1'이라고 가정한다.
if N > 1:
    dp[2] = [1, 1]
for i in range(3, N + 1):
    dp[i][0] = ((dp[i - 2][0] % 15746) + (dp[i - 2][1] % 15746)) % 15746
    dp[i][1] = ((dp[i - 1][0] % 15746) + (dp[i - 1][1] % 15746)) % 15746

print(sum(dp[N]) % 15746)
