"""
0  => 1개
1, 0/1,   => 2개
2, 0/2, 1/2, 0/1/2 => 4개
3, => 1개
   0/3, 1/3, 2/3, => 3개 
   0/1/3, 0/2/3, 1/2/3 => 3개 => 2개 + 1개
   0/1/2/3 => 6개
4, => 1개
   0/4, 1/4, 2/4, 3/4, => 4개 => N개
   0/1/4, 0/2/4, 0/3/4, 1/2/4, 1/3/4,  2/3/4 => 6개 => 3개 + 2개 + 1개
   0/1/2/4, 0/1/3/4, 0/2/3/4, 1/2/3/4 =>15개 =>
   0/1/2/3/4 => 1개
5



1 => 1, 1
2 => 3, 10
3 => 4, 11
4 => 9,  100
5 => 10, 101
6 => 12, 110
7 => 13, 111
"""
import sys
input = sys.stdin.readline

Q = int(input())
while Q:
    Q -= 1

    N = int(input())
    
    val = N
    arr = []
    ans = 0
    while val > 0:
        if val % 2:
            arr.append(1)
        else:
            arr.append(0)

        val //= 2

    m = 1
    while arr:
        ans += arr.pop(0) * m
        m *= 3

    print(ans)